{
    "files": {
        "/test.txt": "This is a test file", 
        "/various/test2.txt": "<img src='./img.png' alt='this is an image'>",
        "/help":"<span style='font-weight:bold;color:aqua;'>LanceOS 0.8.911 EXPERIMENTAL Onboard User Manual</span> <br><br> LanceOS is the operating system for your Field Personal Data Assistant. Below instructions describe how the device operates, file system navigation as well as a list of available commands.<br><br> <span style='font-weight:bold; color: aqua;'>LAYOUT</span><br>Layout of the LanceOS consists of three elements. At the top, there is <span style='color: aqua;'>current working directory path</span> ribbon. <br>Below it, there are two panels. Left panel always contains <span style='color: aqua;'>current working directory</span>. <br> Right panel is the <span style='color: aqua;'>active panel</span>. It's contents are related to currently selected <span style='color: aqua;'>mode</span>. <br><br><span style='font-weight:bold; color: aqua;'>MODES</span><br>LanceOS can operate in two modes: <span style='color: aqua;'>FILESYSTEM</span> and <span style='color: aqua;'>COMMANDLINE</span>. <br>Currently you're viewing this file in <span style='color: aqua;'>FILESYSTEM</span> mode. In this mode you can navigate currently engaged filesystem with <span style='color: aqua;'>UP</span> and <span style='color: aqua;'>DOWN</span> arrows and <span style='color: aqua;'>ENTER</span> to change directories <span style='color: aqua;'>BACKSPACE</span> will navigate to previous directory. The <span style='color: aqua;'>active panel</span> will display the currently selected file contents or highlighted directory. To engage <span style='color: aqua;'>COMMADLINE</span> mode, hit <span style='color: aqua;'>:</span> key.<br> In <span style='color: aqua;'>COMMANDLINE</span> mode you may engage with LanceOS more deeply. To do that, type commands with alphanumeric characters and hit <span style='color: aqua;'>ENTER</span> to confirm. Different kinds messages are denoted with prefixes. <li> <ul><span style='color: aqua;'>! </span> denotes critical system messages</ul> <ul><span style='color: aqua;'>> </span>denotes your previously entered commands</ul> <ul>No prefix denotes standard system responses.</ul> </li> To engage <span style='color: aqua;'>FILESYSTEM</span> mode, hit <span style='color: aqua;'>ESCAPE</span>. <br><br><span style='color: aqua;font-weight:bold;'>COMMANDS</span> <br> <li> <ul><span style='color: aqua;'>help</span> - opens LanceOS Onboard User Manual.</ul> <ul><span style='color: aqua;'>open [path]</span> - navigates directly to specified path and engages FILESYSTEM mode.</ul> <ul><span style='color: aqua;'>time</span> - returns current time and date.</ul> <ul><span style='color: aqua;'>clear</span> - clears commandline history.</ul> <ul><span style='color: aqua;'>fs [filesystem]</span> - changes current filesystem.</ul> <ul><span style='color: aqua;'>cat [path]</span> - prints raw information from path to commandline. May not work correctly in all cases. </ul></li> <br><br> <span style='color: aqua;font-weight:bold;'>FILESYSTEM</span> <br> LanceOS is a <span style='color: aqua;'>remote encrypted data reader </span> software. This means all presented information are stored remotely and safely within secure databases. This device, equipped with face recognition, voice recognition and vitals monitor modules, serves purpose to safely access and display remote data. Formerly mentioned modules ensure data can not be accessed by unauthorised units. <br>Upon detected death of an authorised user, device shall engage data preservation and self-destruction protocols to prevent possible reverse engineering of the device. User may engage these protocols manually, by pinching red pins on both sides of the display. Biometric scanners on the pins ensure this operation will not happen by accident or an unauthorised user. Explosion resulting from engaging formerly mentioned protocols is fatal at range up to 3 meters from the device. Explosion is extremely harmful up to 10 meters from the device. Explosion is potentially harmful up to 15 meters from the device. Advised safe distance from the device is about 25 meters. Explosion range may vary depending on atmospherical conditions and planetary physical properties. Extreme magnetic field distortions, such as Standard Electromagnetic Strike may trigger the data preservation and self-destruction protocols. The data preservation and self-destruction protocols may be disengaged by a voice command from an authorised user or pinching the red pins a second time."
    },

    "filesystem":
    [
        {"path":"", "name":"<--", "type":"previous"},
        {"path":"", "name":"/", "type":"directory"},
        {"path":"/", "name":"help", "type":"file"},
        {"path":"/", "name":"various/", "type":"directory"},
        {"path":"/various/", "name":"notes.txt", "type":"file"}
    ]

}
